In [1]:
import pandas as pd
from pandas import Series, DataFrame
from pandas import read_html
import sqlalchemy 
from sqlalchemy import create_engine
import json

In [2]:
file_path="C://Users//oa//Desktop//shay//לימודים//פרויקט גמר//python data//raw-department.txt"
department=pd.read_csv(file_path,delimiter='-')

In [3]:
department

   department_id department_name
0              1         General
1              2   Sales Support
2              3              IT

In [4]:
file_path_json="C://Users//oa//Desktop//shay//לימודים//פרויקט גמר//python data//raw-department-budget.txt"

In [5]:
dep_budjet=pd.read_json(file_path_json,lines=True)

In [6]:
dep_budjet

   sub_dep_id           sub_dep_name  department_id  budget
0           1               managers              1    3000
1           2              managers2              1    1500
2           1     sales support john              2    2000
3           2      sales support joe              2    1000
4           3  sales support johnson              2    2500
5           4  sales support eduards              2    2500

In [7]:
file_path_json2="C://Users//oa//Desktop//shay//לימודים//פרויקט גמר//python data//raw-department-budget2.txt"

In [8]:
with open(file_path_json2, 'r') as file:
    data = json.load(file)

dep_budget2 = pd.DataFrame(data)

In [9]:
dep_budget2

   sub_dep_id    sub_dep_name  department_id  budget
0           1    IT purchases              3    2000
1           2  IT maintenance              3    1500
2           3        IT other              3    1000

In [10]:
budget= pd.concat([dep_budjet, dep_budget2], ignore_index=True)

In [11]:
budget

   sub_dep_id           sub_dep_name  department_id  budget
0           1               managers              1    3000
1           2              managers2              1    1500
2           1     sales support john              2    2000
3           2      sales support joe              2    1000
4           3  sales support johnson              2    2500
5           4  sales support eduards              2    2500
6           1           IT purchases              3    2000
7           2         IT maintenance              3    1500
8           3               IT other              3    1000

In [12]:
department_budget = pd.merge(department, budget, on='department_id', how='inner')

In [13]:
department_budget

   department_id department_name  sub_dep_id           sub_dep_name  budget
0              1         General           1               managers    3000
1              1         General           2              managers2    1500
2              2   Sales Support           1     sales support john    2000
3              2   Sales Support           2      sales support joe    1000
4              2   Sales Support           3  sales support johnson    2500
5              2   Sales Support           4  sales support eduards    2500
6              3              IT           1           IT purchases    2000
7              3              IT           2         IT maintenance    1500
8              3              IT           3               IT other    1000

In [14]:
department_budget = department_budget.groupby(['department_id', 'department_name'], as_index=False)['budget'].sum()

In [15]:
department_budget

   department_id department_name  budget
0              1         General    4500
1              2   Sales Support    8000
2              3              IT    4500

In [16]:
department_budget

   department_id department_name  budget
0              1         General    4500
1              2   Sales Support    8000
2              3              IT    4500

In [17]:
DATABASE_URL='postgresql+psycopg2://postgres:postgres@localhost:5432/chinook'
engine = create_engine(DATABASE_URL)

In [18]:

department_budget.to_sql('department_budget', engine, schema='stg', index=False, if_exists='replace')

3